{"title": "Netanyahu seeks parliamentary immunity that could delay corruption trial until after election", "body": "Prime Minister Benjamin Netanyahu faces charges of bribery, fraud and breach of trust; Rich Edson reports from the State Department. Israeli’s prime minister said Wednesday that he will seek parliamentary immunity from prosecution from the corruption charges brought against him, a move that could delay his trial until the spring. Benjamin Netanyahu’s announcement will likely put the trial against him on hold until after the elections in March, when he hopes to win a majority coalition that will shield him from prosecution. In Israel, a trial cannot get underway once an immunity request is made. ISRAEL'S NETANYAHU WINS LIKUD PARTY PRIMARY CHALLENGE IN LANDSLIDE Israeli’s prime minister said Wednesday that he will seek parliamentary immunity from prosecution in the corruption charges against him, which could delay his trial until after the elections. (Patricia de Melo Moreira/Pool via REUTERS) Netanyahu was indicted in November on charges of bribery, fraud and breach of trust over allegations he granted state favors worth hundreds of millions of dollars to Israeli media barons in return for gifts and favorable coverage. The 70-year-old once again denied any wrongdoing during a nationally televised address Wednesday. He said he would seek to invoke the law that would protect him from prosecution while he remains in office. “In order to continue to lead Israel to great achievements, I intended to approach the speaker of the Knesset in accordance with chapter 4C of the law, in order to fulfill my right, my duty and my mission to continue to serve you for the future of Israel,” he said. NETANYAHU RUSHED TO BOMB SHELTER AFTER ROCKET ATTACK ON SOUTHERN ISRAEL The announcement came just four hours before a deadline for an application for immunity was set to expire, Reuters reported. Amid a deep political deadlock, Israeli’s parliament seems unlikely to decide the issue before the March 2 election. The current caretaker government is not empowered to make a decision on granting Netanyahu immunity. CLICK HERE TO GET THE FOX NEWS APP In order to debate the matter, parliament would have to appoint a special committee that needs to study the request. But it remains unclear whether it will be allowed to do so. The Associated Press contributed to this report."}
{"title": "Israel PM seeks immunity, buying time until after vote", "body": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu said Wednesday he would seek immunity from corruption charges, likely delaying any trial until after March elections, when he hopes to have a majority coalition that will shield him from prosecution. Netanyahu was indicted in November on charges of accepting bribes, fraud and breach of trust. After failing to assemble a governing majority following back-to-back elections last year, he will get a third shot at remaining in office in March. Wednesday’s announcement essentially turns the upcoming election into a referendum on whether Netanyahu should be granted immunity and remain in office, or step down and stand trial. A recent poll indicated that a majority of Israelis oppose giving him immunity. In a nationally televised address, Netanyahu repeated his assertion that he is the victim of an unfair conspiracy, lashing out at prosecutors, the media and his political enemies. Claiming credit for a series of economic and security achievements on his watch, he said he would seek to invoke the law that would protect him from prosecution as long as he remains in office. “In order to continue to lead Israel to great achievements, I intend to approach the speaker of the Knesset in accordance with chapter 4C of the law, in order to fulfill my right, my duty and my mission to continue to serve you for the future of Israel,” he said."}
{"title": "Israeli PM: I Want Immunity", "body": "(Newser) – Israeli Prime Minister Benjamin Netanyahu said Wednesday he would seek immunity from corruption charges, likely delaying any trial until after March elections, when he hopes to have a majority coalition that will shield him from prosecution, the AP reports. Netanyahu was indicted in November on charges of accepting bribes, fraud, and breach of trust. After failing to assemble a governing majority following back-to-back elections last year, he will get a third shot at remaining in office in March. Wednesday's announcement essentially turns the upcoming election into a referendum on whether Netanyahu should be granted immunity and remain in office, or step down and stand trial. A recent poll indicated that a majority of Israelis oppose giving him immunity. In a nationally televised address, Netanyahu repeated his assertion that he is the victim of an unfair conspiracy. He also said he would seek to invoke the law that would protect him from prosecution as long as he remains in office. \"In order to continue to lead Israel to great achievements, I intend to approach the speaker of the Knesset in accordance with chapter 4C of the law, in order to fulfill my right, my duty and my mission to continue to serve you for the future of Israel,\" he said. Normally, an immunity request would need to be approved by the parliament’s House Committee and submitted to a full vote. But the House Committee doesn't exist because a government was never formed after September's election. Court proceedings cannot begin until the question of immunity is settled. (Read more Benjamin Netanyahu stories.)"}
{"title": "Israel PM seeks immunity, buying time until after vote", "body": "JERUSALEM — Israeli Prime Minister Benjamin Netanyahu said Wednesday he would seek immunity from corruption charges, likely delaying any trial until after March elections, when he hopes to have a majority coalition that will shield him from prosecution.Netanyahu was indicted in November on charges of accepting bribes, fraud and breach of trust. After failing to assemble a governing majority following back- [...]"}
{"title": "Israeli Prime Minister Benjamin Netanyahu will seek immunity from corruption charges", "body": "Israeli Prime Minister Benjamin Netanyahu said Wednesday that he will seek immunity from charges that accuse him of accepting bribes, fraud and breach of trust. The move will likely delay any trial until after the March elections, when he hopes to have a majority coalition that will shield him from prosecution. Netanyahu was indicted in November on the corruption charges. After failing to assemble a governing majority following back-to-back elections last year, he will get a third shot at remaining in office in March. Wednesday's announcement essentially turned the upcoming election into a referendum on whether Netanyahu should be granted immunity and remain in office, or step down and stand trial. A recent poll indicated that a majority of Israelis oppose giving him immunity. In a nationally televised address, Netanyahu repeated his assertion that he is the victim of an unfair conspiracy, lashing out at prosecutors, the media and his political enemies. Claiming credit for a series of economic and security achievements on his watch, he said he would seek to invoke the law that would protect him from prosecution as long as he remains in office. \"In order to continue to lead Israel to great achievements, I intend to approach the speaker of the Knesset in accordance with chapter 4C of the law, in order to fulfill my right, my duty and my mission to continue to serve you for the future of Israel,\" he said. Normally, a request for immunity would need to be approved by the parliament's House Committee and then submitted to a full vote. But the House Committee doesn't exist because a government was never formed after September's election. Court proceedings cannot begin until the question of immunity is settled. The opposition Blue and White party said it will seek to form the House Committee before the March election to take up the question of immunity — but it remains unclear whether it will be able to move forward. Parliament Speaker Yuli Edelstein, a member of Netanyahu's Likud Party, said he would hold talks on the matter next week. The Blue and White leader, former military chief Benny Gantz, said it was a \"sad day.\" \"I never imagined that we would see the day that the prime minister of Israel would avoid standing before the law and the justice system,\" he said. \"Today it's clear what we're fighting for. Netanyahu knows he's guilty.\" Netanyahu said he was not evading justice and still plans to go to court to fight the \"fabricated accusations.\" \"The law is meant to ensure that elected officials can serve the people according to the will of the people,\" he said. Should Netanyahu succeed in assembling a 61-seat majority in favor of immunity, he would avoid prosecution. But that still appears unlikely after the March vote, with most polls predicting another split decision that would leave Likud and Blue and White deadlocked, with neither able to secure a parliamentary majority. The uncertainty means it could be many months before a new government"}
{"title": "Israel's Netanyahu seeks immunity from prosecution in corruption cases - Video", "body": "Israeli Prime Minister Benjamin Netanyahu has requested immunity from prosecution in three corruption cases in which he faces indictment on charges of bribery, fraud and breach of trust. CNN's Oren Liebermann reports."}
{"title": "Israel's Netanyahu seeks immunity from prosecution in corruption cases", "body": "(CNN) Israeli Prime Minister Benjamin Netanyahu has requested immunity from prosecution in three corruption cases in which he faces indictment on charges of bribery, fraud and breach of trust. Netanyahu submitted the request to the Knesset late Wednesday night, saying he plans on leading the country \"for many years to come.\" \"What is being done to me is a field court-martial by misleading the public,\" Netanyahu said in a televised statement Wednesday evening in Jerusalem. \"The immunity law is intended to protect elected officials from fabricated legal proceedings -- from political indictment intended to damage the will of the people. This law intends to ensure that those elected can serve the people according to the will of the people, not the will of the law clerks.\" Charges against Netanyahu were unveiled in November. He's maintained his innocence throughout the ongoing criminal proceedings, calling them an \"attempted coup\" led by the left and the media. Rival Benny Gantz, who leads the Blue and White party, blasted Netanyahu's request, saying voters will have two choices in the upcoming elections in March. \" ... the interests of Netanyahu will win or the national interest will win. Or there will be an extreme immunity government or there will be broad unity government. Or the kingdom of Netanyahu or the State of Israel,\" said Gantz shortly after Netanyahu spoke. \"Blue and White led by me will do everything according to the law.\" Members of Knesset, including the Prime Minister, are entitled by law to request parliamentary immunity from prosecution. The request is considered by the Knesset's House Committee. If the request is approved in the committee, it is then passed on to a vote in the full 120-member Knesset. But the House Committee hasn't been formed since Israel's election in April began a period of prolonged political deadlock. Elections in September failed to break that deadlock, and once again, no House Committee was formed. Without a seated committee, there is no way to consider Netanyahu's request for immunity, putting any criminal proceedings against the Prime Minister on hold at least until the upcoming elections on March 2. Members of the opposition have said they would seek to form a temporary House Committee to consider the immunity request, but it's unclear at this stage if such a move is likely to happen. If granted, the immunity from prosecution applies only to the current Knesset, meaning Netanyahu would have to request immunity again following any subsequent election. Moments after Netanyahu finished his statement, former Defense Minister Avigdor Liberman said his Yisrael Beiteinu would vote unanimously against immunity. \"It's now clear beyond any doubt. All that Netanyahu is interested in is immunity,\" said Liberman in a statement. \"This is what he wakes up with in the morning, this is what he lives, this is what he breathes throughout the day, this is what he goes to bed with. The State of Israel has become a hostage of a private personal problem of Netanyahu.\" If the immunity request is"}
{"title": "Israeli court declines to rule on Netanyahu’s eligibility", "body": "The court had been widely expected to delay any ruling. Judging Netanyahu ineligible would have triggered a major political crisis and exacerbated already strained ties between the government and the judiciary. Netanyahu was indicted in November on charges of bribery, fraud and breach of trust. Israeli Cabinet members are required to resign if indicted, but the rule does not apply to the prime minister. He has continued serving as caretaker prime minister after failing to form a government after unprecedented back-to-back elections last year. Netanyahu has dismissed the corruption cases against him as an “attempted coup” and warned against any judicial intervention, saying only the voters can choose the country’s leader. There are no restrictions on Netanyahu running in the March 2 election — the third in less than a year. But the petition, filed by good government groups, contended that having a prime minister under indictment would constitute a conflict of interest. Others have argued that voters have the right to know before the election if Netanyahu is eligible to be prime minister. The court said that the election campaign period is “a realm of uncertainty” and that it remains to be seen who the president will select to form a government after the March 2 vote. The judges said that in light of the “most sensitive and complicated period the state of Israel is in at this time,” it decided to “act with restraint and moderation” and dismiss the petition for the time being. The court’s decision came the day after Netanyahu announced that he would seek immunity from prosecution, effectively delaying any trial until after a new government is formed. Netanyahu hopes to win big in March and assemble a 61-seat majority in favor of immunity. But polls predict another split decision that would prolong the country’s political limbo. September’s election left Netanyahu’s right-wing Likud party in a virtual tie with the centrist Blue and White, led by former army chief of staff Benny Gantz. Neither was able to assemble a majority with its natural allies, and efforts to form a unity government collapsed in large part because of Netanyahu’s legal woes. Netanyahu, who was re-elected leader of the ruling Likud party last week, has long accused judicial and law enforcement officials of trying to drive him from office. His allies have issued stern warnings against what they call an “activist” court overstepping its authority and a few dozen pro-Netanyahu protesters convened outside the court in Jerusalem. Netanyahu has been in power for more than a decade and is Israel’s longest-serving leader. He is also Israel’s first sitting prime minister to be charged with a crime. His predecessor, Ehud Olmert, was forced to resign a decade ago ahead of a corruption indictment that later sent him to prison for 16 months. Associated Press writer Ilan Ben Zion contributed. Copyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}
{"title": "NEO: Can Bibi hustle a pardon to avoid jail? – Veterans Today | Military Foreign Affairs Policy Journal for Clandestine Services", "body": "by Jim W. Dean, with New Eastern Outlook, Moscow “With a gentleman I am always a gentleman and a half, and with a fraud I try to be a fraud and a half.” ~ Otto von Bismarck, Chancellor of the German Empire, 1871-1890 [ Editor’s Note: Bibi wraps up the year still out of jail and continuing to charge everyone who is after him as involved in a coup to remove him. One thing you have to give him credit for, he ain’t no quitter. My NEO piece below was a review of the situation after no political figure or party has been able to put a government coalition together to avoid a third election, something dreaded by all except Netanyahu. He is still interim prime minister, collecting a badly needed paycheck with his legal bills, and with next election round he has more time to wiggle out of his legal jam. The news this week was that the reformers who had filed a Supreme Court case to block him from running due to his indictment were turned down. The three judges ruled that there was no precedent to block him from running, and the only legal issue that could arise would be if he wins, and could he then take office while under indictment. As an inducement for Bibi to pull out of the last battle to form a government, giving him a pardon was floated from multiple directions, including the Attorney General and even President Rivlin. But Bibi just smiled and bided his time, remaining on the offensive with all of his detractors, refusing to give up the world wide pulpit his has to stay in the game. So like it or not, it is not just the Israelis who are stuck with him for at least the next six months, but the whole world. What did we do to deserve this I ask? But it does look like he will have to share the political scandal stage. Read below about the two new major cases with the ex-Navy and some close to Bibi being indicted in the submarine affair, and then a corruption sex drama in judicial appointments with a handsome senior judge bedding down and attractive female one wanting to climb the ladder by bedding down the former…JD ] Jim's Editor’s Notes are solely crowdfunded via PayPal Jim's work includes research, field trips, Heritage TV Legacy archiving & more. Thanks for helping. Click to donate >> An exhausted Israeli public is getting a temporary respite from Israel’s two failed attempts to form a government by a hopelessly divided Knesset. The political party battle lines remain hardened, as no compromise was possible to put a majority coalition together. It seems the political egos must be served first, and the country’s interests come second. March 2, 2020 is set for the next polling date. Early polls show Benny Gantz’ party, Blue and White, picking up 2 to 4 seats, and some shifting relations among the minor parties. For"}
{"title": "Benjamin Netanyahu requests immunity from criminal prosecution", "body": "Jan. 1 (UPI) -- Israeli Prime Minister Benjamin Netanyahu announced Wednesday he has requested immunity from prosecution on charges of bribery, fraud and breach of trust. Netanyahu said in a televised speech from Jerusalem's Orient Hotel Wednesday night that he had sent a letter of request to the Knesset, explaining that it is not an attempt to evade justice as immunity would only be in place during the term of the parliament that granted it. \"I will come to court and quash all the ridiculous libels against me,\" he said. \"The immunity law is intended to protect elected officials from manufactured cases, and guarantee that those elected by the people can serve the people according to their will and not the will of the legal officials.\" The three charges against him were unveiled in November, accusing him of having received gifts as the prime minister, paid for favorable news coverage and made regulatory moves to benefit news outlets in exchange for positive coverage. In the letter written by his lawyers to Knesset Speaker Yuli Edelstein, Netanyahu reiterated his innocence and requested immunity claiming the prosecution discriminatorily targeted him and that the court proceedings would harm the government. When the charges were first announced, Netanyahu dismissed them, describing the lengthy investigation that produced the three indictments as a \"witch hunt.\" The request comes as Netanyahu, leader of the Likud Party, is campaigning to secure a fourth term at the country's helm. The country is to head to the polls March 2 after he twice failed in 2019 to cobble together a coalition government. Benny Gantz, leader of the Blue and White Party and Netanyahu's chief political rival, lambasted the immunity request in a televised speech of his own. \"I never imagined we would see the day when a prime minister of Israel would avoid standing before the law and the courts,\" Gantz said. The former military chief said the request shows that Netanyahu understands he is guilty and that the choice of granting immunity comes down to choosing between \"the kingdom of Netanyahu or the state of Israel.\" He said his party will amend the immunity law to prevent a prime minister from escaping criminal charges, calling such immunity corruption. \"We will not allow the legislature to become a haven for criminals,\" he said on Twitter. Avigdor Liberman, chairman of the Yisrael Beytenu Party, said they will vote down the immunity request, saying the country has been \"taken hostage by [Netanyahu's] personal and private problems.\" \"We are not going to be part of an immunity coalition,\" he said. \"We will vote against immunity.\" The Knesset House Committee, which has been defunct over the last year due to the consecutive elections, will next discuss whether to grant the immunity request."}
{"title": "Netanyahu to seek immunity from charges\nIsrael PM seeks immunity, buying time until after vote", "body": "JERUSALEM- Israeli Prime Minister Benjamin Netanyahu said Wednesday he would seek immunity from corruption charges, likely delaying any trial until after March elections, when he hopes to have a majority coalition that will shield him from prosecution. Netanyahu was indicted in November on charges of accepting bribes, fraud and breach of trust. After failing to assemble a governing majority following back-to-back elections last year, he will get a third shot at remaining in office in March. Wednesday's announcement essentially turns the upcoming election into a referendum on whether Netanyahu should be granted immunity and remain in office, or step down and stand trial. A recent poll indicated that a majority of Israelis oppose giving him immunity. In a nationally televised address, Netanyahu repeated his assertion that he is the victim of an unfair conspiracy, lashing out at prosecutors, the media and his political enemies. Claiming credit for a series of economic and security achievements on his watch, he said he would seek to invoke the law that would protect him from prosecution as long as he remains in office. \"In order to continue to lead Israel to great achievements, I intend to approach the speaker of the Knesset in accordance with chapter 4C of the law, in order to fulfill my right, my duty and my mission to continue to serve you for the future of Israel,\" he said. Normally, a request for immunity would need to be approved by the parliament's House Committee and then submitted to a full vote. But the House Committee doesn't exist because a government was never formed after September's election. Court proceedings cannot begin until the question of immunity is settled. The opposition Blue and White party said it will seek to form the House Committee before the March election to take up the question of immunity. But it remains unclear whether it will be able to move forward. Parliament Speaker Yuli Edelstein, a member of Netanyahu's Likud Party, said he would hold talks on the matter next week. The Blue and White leader, former military chief Benny Gantz, said it was a \"sad day.\" \"I never imagined that we would see the day that the prime minister of Israel would avoid standing before the law and the justice system,\" he said. \"Today it's clear what we're fighting for. Netanyahu knows he's guilty.\" Netanyahu said he was not evading justice and still plans to go to court to fight the \"fabricated accusations.\" \"The law is meant to ensure that elected officials can serve the people according to the will of the people,\" he said. Should Netanyahu succeed in assembling a 61-seat majority in favor of immunity, he would avoid prosecution. But that still appears unlikely after the March vote, with most polls predicting another split decision that would leave Likud and Blue and White deadlocked. The uncertainty means it could be many months before a new government is formed, leaving the question of immunity on hold with Netanyahu remaining in office. The indictment, on"}
{"title": "Israeli court declines to rule on Netanyahu's eligibility", "body": "Israeli PM Netanyahu to be indicted on corruption charges published: 28 Feb 2019 views: 20694 Just months before his reelection bid, Israeli Prime Minister Benjamin Netanyahu is expected to be charged with bribery, fraud, and breach of trust. Netanyahu has denied wrongdoing and labeled the indictment as politically motivated. CBS News foreign correspondent Seth Doane joined CBSN to discuss what this means for Netanyahu and Israel. Subscribe to the CBS News Channel HERE: http://youtube.com/cbsnews Watch CBSN live HERE: http://cbsn.ws/1PlLpZ7 Follow CBS News on Instagram HERE: https://www.instagram.com/cbsnews/ Like CBS News on Facebook HERE: http://facebook.com/cbsnews Follow CBS News on Twitter HERE: http://twitter.com/cbsnews Get the latest news and best in original reporting from CBS News delivered to your inbox. Subscribe to newsletters HERE: http://cbsn.ws/1RqHw7T Get your news on the go! Download CBS News mobile apps HERE: http://cbsn.ws/1Xb1WC8 Get new episodes of shows you love across devices the next day, stream CBSN and local news live, and watch full seasons of CBS fan favorites like Star Trek Discovery anytime, anywhere with CBS All Access. Try it free! http://bit.ly/1OQA29B --- CBSN is the first digital streaming news network that will allow Internet-connected consumers to watch live, anchored news coverage on their connected TV and other devices. At launch, the network is available 24/7 and makes all of the resources of CBS News available directly on digital platforms with live, anchored coverage 15 hours each weekday. CBSN. Always On.... Israeli PM Netanyahu to be indicted on corruption charges published: 28 Feb 2019 views: 20694 Just months before his reelection bid, Israeli Prime Minister Benjamin Netanyahu is expected to be charged with bribery, fraud, and breach of trust. Netanyahu has denied wrongdoing and labeled the indictment as politically motivated. CBS News foreign correspondent Seth Doane joined CBSN to discuss what this means for Netanyahu and Israel. Subscribe to the CBS News Channel HERE: http://youtube.com/cbsnews Watch CBSN live HERE: http://cbsn.ws/1PlLpZ7 Follow CBS News on Instagram HERE: https://www.instagram.com/cbsnews/ Like CBS News on Facebook HERE: http://facebook.com/cbsnews Follow CBS News on Twitter HERE: http://twitter.com/cbsnews Get the latest news and best in original reporting from CBS News delivered to your inbox. Subscribe to newsletters HERE: http://cbsn.ws/1RqHw7T Get your news on the go! Download CBS News mobile apps HERE: http://cbsn.ws/1Xb1WC8 Get new episodes of shows you love across devices the next day, stream CBSN and local news live, and watch full seasons of CBS fan favorites like Star Trek Discovery anytime, anywhere with CBS All Access. Try it free! http://bit.ly/1OQA29B --- CBSN is the first digital streaming news network that will allow Internet-connected consumers to watch live, anchored news coverage on their connected TV and other devices. At launch, the network is available 24/7 and makes all of the resources of CBS News available directly on digital platforms with live, anchored coverage 15 hours each weekday. CBSN. Always On...."}
{"title": "Benjamin Netanyahu is trying to put himself above the law", "body": "Israeli Prime Minister Benjamin Netanyahu is battling corruption and bribery charges while simultaneously campaigning for reelection in March 2020. On New Year’s Day, he gave a speech that tried to tackle both topics at once — asking Israel’s parliament, the Knesset, to grant him temporary immunity from prosecution. “Immunity is intended to protect elected representatives from trumped-up charges,” Netanyahu said. “I intend to keep leading Israel for many more years.” The crimes of which Netanyahu is accused are serious, not “trumped up.” And his request is vanishingly unlikely to succeed in the short term, as the idea does not appear to be able to win majority support in the Knesset. His appeal is best understood as a political gambit on two fronts. First, Netanyahu is bogging down the indictments in parliamentary procedure, preventing any politically damaging headlines regarding the case against him from being published until after the election. Secondly, he’s trying to use the immunity bid to rally his hardcore supporters by making it clear that no immunity will be forthcoming without a victory at the polls. If Netanyahu and his allies win March’s election, it’s likely that immunity would be at the top of their agenda. The entire situation lays bare the stakes of the election with regard to the country’s democracy. A Netanyahu victory would allow a man who is already Israel’s longest-serving prime minister to both stay in office and grant himself immunity from allegations of serious criminal activity, including two separate schemes involving using the powers of his office to buy favorable media coverage. After Wednesday’s speech, Netanyahu’s chief political rival — the centrist Blue and White party leader Benny Gantz — claimed the election was a choice for Israeli voters: They could have either “the Kingdom of Netanyahu … or the State of Israel.” He might very well be right. What the immunity request is — and why it matters so much The indictment against Netanyahu covers three different cases, with his alleged offenses including his receipt of inappropriate gifts from a billionaire and his corrupt arrangements with media magnates aimed at improving his press coverage. The technical charges are bribery, fraud, and breach of public trust — bribery being the most serious under Israeli law. Jail time is not out of the question: Former Prime Minister Ehud Olmert got wrapped up in a bribery scandal during his time in office in the late 2000s and eventually served over a year in prison. Legally speaking, Netanyahu is well within his rights to request immunity from these charges while in office. Israel’s Basic Law (its equivalent to a constitution) allows for any members of the Knesset to request immunity from prosecution; another piece of legislation, known as the Immunity Law, helps codify how that process works. The best technical explanation of all of this comes from Jonathan Lis, a reporter at Ha’aretz, Israel’s paper of record: He describes the four reasons for which a legislator can seek immunity: If the crime was committed as part"}
{"title": "Israel PM seeks immunity, buying time until after vote", "body": "JERUSALEM — Israeli Prime Minister Benjamin Netanyahu said Wednesday he would seek immunity from corruption charges, likely delaying any trial until after March elections, when he hopes to have a majority coalition that will shield him from prosecution. Netanyahu was indicted in November on charges of accepting bribes, fraud and breach of trust. After failing to assemble a governing majority following back-to-back elections last year, he will get a third shot at remaining in office in March. Wednesday’s announcement essentially turns the upcoming election into a referendum on whether Netanyahu should be granted immunity and remain in office, or step down and stand trial. A recent poll indicated that a majority of Israelis oppose giving him immunity. From Wire Reports In a nationally televised address, Netanyahu repeated his assertion that he is the victim of an unfair conspiracy, lashing out at prosecutors, the media and his political enemies. Claiming credit for a series of economic and security achievements on his watch, he said he would seek to invoke the law that would protect him from prosecution as long as he remains in office. “In order to continue to lead Israel to great achievements, I intend to approach the speaker of the Knesset in accordance with chapter 4C of the law, in order to fulfill my right, my duty and my mission to continue to serve you for the future of Israel,” he said. Normally, a request for immunity would need to be approved by the parliament’s House Committee and then submitted to a full vote. But the House Committee doesn’t exist because a government was never formed after September’s election. Court proceedings cannot begin until the question of immunity is settled."}
